app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = $1  ORDER BY published DESC  [["user_id", 1]]
---
        <dl>
          <% @user.posts.each do |p|  %>