app/views/posts/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
      <dt><%= link_to post.title, post_path(post) %></dt>
      <dd>Published by <%= User.find(post.user_id).username %> on <time datetime="<%= post.published.strftime('%Y-%m-%dT%H:%M%z') %>"><%= post.published.strftime("%B %d, %Y at %I:%M%P \(%Z\)") %></time></dd>