app/views/posts/show.html.erb

    <h2>Comments</h2>
    <% if @post.comments.any? %>
---
SELECT  1 AS one FROM "comments" WHERE "comments"."post_id" = $1 LIMIT 1  [["post_id", 10]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  ORDER BY published DESC  [["post_id", 8]]