app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1  ORDER BY published DESC LIMIT 1  [["id", 8]]
---
  def new
    @post = Post.find(params[:post_id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1  ORDER BY published DESC LIMIT 1  [["id", 8]]
INSERT INTO "comments" ("text", "post_id", "published", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["text", "Comment text."], ["post_id", 136], ["published", "2015-03-27 23:29:24.220523"], ["user_id", 1], ["created_at", "2015-03-27 23:29:24.221391"], ["updated_at", "2015-03-27 23:29:24.221391"]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.new(comment_params)
    @comment.published = Time.now
    @comment.user_id = current_user.id
    if @comment.save
      flash[:notice] = "Your comment has been successfully added!"# + User.find(@comment.user_id).username