app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT "posts".* FROM "posts"  ORDER BY published DESC

  def show
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1  ORDER BY published DESC LIMIT 1  [["id", 8]]

  def create
    @post = current_user.posts.new(post_params)
    @post.published = Time.now
    if @post.save
---
INSERT INTO "posts" ("title", "entry", "published", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Test Title"], ["entry", "Test Entry"], ["published", "2015-03-20 20:34:20.118378"], ["created_at", "2015-03-20 20:34:20.118939"], ["updated_at", "2015-03-20 20:34:20.118939"]]

  def edit
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1  ORDER BY published DESC LIMIT 1  [["id", 12]]

  def update
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1  ORDER BY published DESC LIMIT 1  [["id", 12]]

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1  ORDER BY published DESC LIMIT 1  [["id", 11]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 15]]