app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_salt", "password_hash", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @user = User.new(user_params)
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "users" SET "password_salt" = $1, "password_hash" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["password_salt", "$2a$10$qhwH2ERTI.lLzKqpHoFoY."], ["password_hash", "$2a$10$qhwH2ERTI.lLzKqpHoFoY.uBRwZ89bwlbzZSn4ytLaEYAvdYnQJs2"], ["updated_at", "2015-03-27 22:28:11.095001"], ["id", 1]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)